renatobarresi/genLogger/source/microcontroller/stm32f429zi/src/uart.c
/**
 * @file uart.c
 * @author Renato Barresi (renatobarresi@gmail.com)
 * @brief 
 * @version 0.1
 * @date 2025-02-03
 * 
 * @copyright Copyright (c) 2025
 * 
 */

////////////////////////////////////////////////////////////////////////
//							    Includes
////////////////////////////////////////////////////////////////////////

#include "uart.h"
#include "stm32f4xx_hal.h"
#include "stm32f4xx_hal_uart.h"
#include <string.h>

////////////////////////////////////////////////////////////////////////
//							Defines
////////////////////////////////////////////////////////////////////////

#define UART_RX_BUFFER_SIZE 1024

////////////////////////////////////////////////////////////////////////
//							Private variables
////////////////////////////////////////////////////////////////////////

UART_HandleTypeDef huart3;
DMA_HandleTypeDef  hdma_usart3_rx;
DMA_HandleTypeDef  hdma_usart3_tx;

static volatile uint8_t isDataAvailableFlag = 0;

static uint8_t uart_rx_buffer[UART_RX_BUFFER_SIZE];

////////////////////////////////////////////////////////////////////////
//							Functions declarations
////////////////////////////////////////////////////////////////////////

int8_t uart_init()
{
	huart3.Instance			 = USART3;
	huart3.Init.BaudRate	 = 115200;
	huart3.Init.WordLength	 = UART_WORDLENGTH_8B;
	huart3.Init.StopBits	 = UART_STOPBITS_1;
	huart3.Init.Parity		 = UART_PARITY_NONE;
	huart3.Init.Mode		 = UART_MODE_TX_RX;
	huart3.Init.HwFlowCtl	 = UART_HWCONTROL_NONE;
	huart3.Init.OverSampling = UART_OVERSAMPLING_16;

	if (HAL_UART_Init(&huart3) != HAL_OK)
	{
		return -1;
	}

	return 1;
}

/**
* @brief UART MSP Initialization
* This function configures the hardware resources used in this example
* @param huart: UART handle pointer
* @retval None
*/
void HAL_UART_MspInit(UART_HandleTypeDef* huart)
{
	GPIO_InitTypeDef GPIO_InitStruct = {0};
	if (huart->Instance == USART3)
	{
		/* USER CODE BEGIN USART3_MspInit 0 */

		/* USER CODE END USART3_MspInit 0 */
		/* Peripheral clock enable */
		__HAL_RCC_USART3_CLK_ENABLE();

		__HAL_RCC_GPIOD_CLK_ENABLE();
		/**USART3 GPIO Configuration
    PD8     ------> USART3_TX
    PD9     ------> USART3_RX
    */
		GPIO_InitStruct.Pin		  = GPIO_PIN_8 | GPIO_PIN_9;
		GPIO_InitStruct.Mode	  = GPIO_MODE_AF_PP;
		GPIO_InitStruct.Pull	  = GPIO_NOPULL;
		GPIO_InitStruct.Speed	  = GPIO_SPEED_FREQ_VERY_HIGH;
		GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
		HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

		/* USART3 DMA Init */
		/* USART3_RX Init */
		hdma_usart3_rx.Instance					= DMA1_Stream1;
		hdma_usart3_rx.Init.Channel				= DMA_CHANNEL_4;
		hdma_usart3_rx.Init.Direction			= DMA_PERIPH_TO_MEMORY;
		hdma_usart3_rx.Init.PeriphInc			= DMA_PINC_DISABLE;
		hdma_usart3_rx.Init.MemInc				= DMA_MINC_ENABLE;
		hdma_usart3_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		hdma_usart3_rx.Init.MemDataAlignment	= DMA_MDATAALIGN_BYTE;
		hdma_usart3_rx.Init.Mode				= DMA_NORMAL;
		hdma_usart3_rx.Init.Priority			= DMA_PRIORITY_LOW;
		hdma_usart3_rx.Init.FIFOMode			= DMA_FIFOMODE_DISABLE;
		if (HAL_DMA_Init(&hdma_usart3_rx) != HAL_OK)
		{
			while (1);
		}

		__HAL_LINKDMA(huart, hdmarx, hdma_usart3_rx);

		/* USART3 DMA Init */
		/* USART3_TX Init */
		hdma_usart3_tx.Instance					= DMA1_Stream3;
		hdma_usart3_tx.Init.Channel				= DMA_CHANNEL_4;
		hdma_usart3_tx.Init.Direction			= DMA_MEMORY_TO_PERIPH;
		hdma_usart3_tx.Init.PeriphInc			= DMA_PINC_DISABLE;
		hdma_usart3_tx.Init.MemInc				= DMA_MINC_ENABLE;
		hdma_usart3_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
		hdma_usart3_tx.Init.MemDataAlignment	= DMA_MDATAALIGN_BYTE;
		hdma_usart3_tx.Init.Mode				= DMA_NORMAL;
		hdma_usart3_tx.Init.Priority			= DMA_PRIORITY_LOW;
		hdma_usart3_tx.Init.FIFOMode			= DMA_FIFOMODE_DISABLE;
		if (HAL_DMA_Init(&hdma_usart3_tx) != HAL_OK)
		{
			while (1);
		}

		__HAL_LINKDMA(huart, hdmatx, hdma_usart3_tx);

		/* USART3 interrupt Init */
		HAL_NVIC_SetPriority(USART3_IRQn, 0, 0);
		HAL_NVIC_EnableIRQ(USART3_IRQn);
		/* USER CODE BEGIN USART3_MspInit 1 */

		/* USER CODE END USART3_MspInit 1 */
	}
}

void uart_tx(const char* pBuff, int buffSize)
{
	HAL_UART_Transmit_DMA(&huart3, (const uint8_t*)pBuff, buffSize);
}

// int __io_putchar(int ch)
// {
// 	char c = ch;
// 	//HAL_UART_Transmit_DMA(&huart3, (const uint8_t*)&ch, 4);
// 	HAL_UART_Transmit(&huart3, (const uint8_t*)&c, 1, 1000);
// 	return 1;
// }

int _write(int file, char* ptr, int len)
{
	(void)file;
	HAL_UART_Transmit(&huart3, (uint8_t*)ptr, len, HAL_MAX_DELAY);
	return len;
}

void uart_start_rx_dma()
{
	//HAL_UART_Receive_DMA(&huart3, uart_rx_buffer, UART_RX_BUFFER_SIZE);
	HAL_UARTEx_ReceiveToIdle_DMA(&huart3, uart_rx_buffer, UART_RX_BUFFER_SIZE);
}
/**
* Enable DMA controller clock
*/
void MX_DMA_Init(void)
{
	/* DMA controller clock enable */
	__HAL_RCC_DMA1_CLK_ENABLE();

	/* DMA interrupt init */
	/* DMA1_Stream1_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(DMA1_Stream1_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(DMA1_Stream1_IRQn);
}

// void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
// {
//   isDataAvailableFlag = 1;
// }

void HAL_UARTEx_RxEventCallback(UART_HandleTypeDef* huart, uint16_t Size)
{
	isDataAvailableFlag = 1;
}

uint8_t uart_isDataAvailable()
{
	return isDataAvailableFlag;
}

void uart_getAvailableData(uint8_t* pBuff, uint16_t buffSize)
{
	//memcpy(pBuff, uart_rx_buffer, buffSize);
	strcpy((char*)pBuff, (char*)uart_rx_buffer);
	memset(uart_rx_buffer, 0, UART_RX_BUFFER_SIZE);
	isDataAvailableFlag = 0;
}